In [28]:
print("Sevina Afi Amalia 2009106042")

Sevina Afi Amalia 2009106042

In [9]:
import pandas as pd

In [120]:
df= pd.read_csv("bank.csv")
df

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
2,41,technician,married,secondary,no,1270,yes,no,unknown,5,1389,1,-1,0,unknown,yes,NaN
3,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes
4,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11157,33,blue-collar,single,primary,no,1,yes,no,cellular,20,apr,257,1,-1,0,unknown,no
11158,39,services,married,secondary,no,733,no,no,unknown,16,jun,83,4,-1,0,unknown,no
11159,32,technician,single,secondary,no,29,no,no,cellular,19,aug,156,2,-1,0,unknown,no
11160,43,technician,married,secondary,no,0,no,yes,cellular,8,may,9,2,172,5,failure,no
11161,34,technician,married,secondary,no,0,no,no,cellular,9,jul,628,1,-1,0,unknown,no

# Jumlah record dan jumlah atribut

In [121]:
# Jumlah record dan jumlah atribut
df.shape

(11162, 17)

# Nama atribut dan jumlah atribut objek dan angka

In [84]:
#Nama atribut dan jumlah atribut objek dan angka
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11162 entries, 0 to 11161
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        11162 non-null  int64
 1   job        11162 non-null  object
 2   marital    11162 non-null  object
 3   education  11162 non-null  object
 4   default    11162 non-null  object
 5   balance    11162 non-null  int64
 6   housing    11162 non-null  object
 7   loan       11162 non-null  object
 8   contact    11162 non-null  object
 9   day        11162 non-null  int64
 10  month      11162 non-null  object
 11  duration   11162 non-null  int64
 12  campaign   11162 non-null  int64
 13  pdays      11162 non-null  int64
 14  previous   11162 non-null  object
 15  poutcome   11162 non-null  object
 16  deposit    11160 non-null  object
dtypes: int64(6), object(11)
memory usage: 1.4+ MB

# Menghitung jumlah atribut dengan nilai null

In [105]:
#Menghitung jumlah atribut dengan nilai null
df.isna().any().sum()

1

# Menampilkan Mean,Max,Min,Standar deviasi,Q1,Q2,Q3

In [109]:
#Menampilkan Mean,Max,Min,Standar deviasi,Q1,Q2,Q3
df.describe()

,age,balance,day,duration,campaign,pdays
count,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000
mean,41.231948,1528.538524,15.658036,371.815087,2.508063,51.330586
std,11.913369,3225.413326,8.420740,347.023179,2.722407,108.758197
min,18.000000,-6847.000000,1.000000,1.000000,-1.000000,-1.000000
25%,32.000000,122.000000,8.000000,138.000000,1.000000,-1.000000
50%,39.000000,550.000000,15.000000,255.000000,2.000000,-1.000000
75%,49.000000,1708.000000,22.000000,495.750000,3.000000,20.750000
max,95.000000,81204.000000,31.000000,3881.000000,63.000000,854.000000

# Menghitung median dari atribut age

In [85]:
#Menghitung median dari atribut age
dm = df["age"].median()
dm

39.0

# Menghitung rata-rata dari atribut balance

In [86]:
#Menghitung rata-rata dari atribut balance
dataMean = df["balance"].sum() / len(df["balance"])
dataMean

1528.5385235620856

# Menghitung nilai maksimum dari atribut age

In [93]:
#Menghitung nilai maksimum dari atribut age
df["age"].max()

95

# Menampilkan nilai korelasi tipe data angka

In [96]:
#Menampilkan nilai korelasi tipe data angka
df.corr()

C:\Users\asus\AppData\Local\Temp\ipykernel_20696\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

               age   balance       day  duration  campaign     pdays
age       1.000000  0.112300 -0.000762  0.000252 -0.005253  0.002774
balance   0.112300  1.000000  0.010467  0.022546 -0.013856  0.017411
day      -0.000762  0.010467  1.000000 -0.017884  0.137149 -0.077234
duration  0.000252  0.022546 -0.017884  1.000000 -0.041139 -0.027154
campaign -0.005253 -0.013856  0.137149 -0.041139  1.000000 -0.102652
pdays     0.002774  0.017411 -0.077234 -0.027154 -0.102652  1.000000

# Menampilkan atribut dengan tipe data object

In [117]:
#Menampilkan atribut dengan tipe data object
df.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous     object
poutcome     object
deposit      object
dtype: object

# Masukkan informasi di atas dalam dictionary dengan key sesuai nama informasinya

In [118]:
#Masukkan informasi di atas dalam dictionary dengan key sesuai nama informasinya
job = ["admin","technician","services","management"]
age = ["43","23","31","30"]
df = pd.DataFrame(
{
    "job":job,
    "age":age
    
})

In [100]:
df.head()

          job age
0       admin  43
1  technician  23
2    services  31
3  management  30

# Menampilkan 10 record pertama dari atribut tipe data angka

In [108]:
#Menampilkan 10 record pertama dari atribut tipe data angka
df.select_dtypes(include=["int64"]).head(10)

   age  balance  day  duration  campaign  pdays
0   59     2343    5      1042         1     -1
1   56       45    5      1467         1     -1
2   41     1270    5         1        -1      0
3   55     2476    5       579         1     -1
4   54      184    5       673         2     -1
5   42        0    5       562         2     -1
6   56      830    6      1201         1     -1
7   60      545    6      1030         1     -1
8   37        1    6         1        -1      0
9   28     5090    6      1297         3     -1

# Merubah nilai balance menjadi bertipe data float dengan 3 angka dibelakang koma

In [111]:
#Merubah nilai balance menjadi bertipe data float dengan 3 angka dibelakang koma
dAngka = df["balance"].astype("float64")*0.001
dAngka

0        2.343
1        0.045
2        1.270
3        2.476
4        0.184
         ...
11157    0.001
11158    0.733
11159    0.029
11160    0.000
11161    0.000
Name: balance, Length: 11162, dtype: float64

# Menyimpan dataset bertipe data angka ke file csv

In [112]:
dAngka.to_csv("Posttestke-2.csv", index=False)